---
kind: type
id: T:Autodesk.Revit.UI.Events.ViewActivatingEventArgs
source: html/3b279e84-422c-ddc4-44df-fa5498124b14.htm
---
# Autodesk.Revit.UI.Events.ViewActivatingEventArgs

The event arguments used by the ViewActivating event.

## Syntax (C#)
```csharp
public class ViewActivatingEventArgs : RevitAPIPreDocEventArgs
```